[{"id":16549056000,"title":"Automating windows apps startup using a batch script and Python commands","author":"Dare O.","date":"2022-06-11","tag":"Lessons","content":"\n<h2 style=\"padding-bottom:1rem\">Introduction</h2>\n\nI often have to click around applications to prepare myself during the start of my work shift, so I thought of a way to automate this process by creating a simple python command that can loop through a list of application dir and start them.\n\nThis code is a template program to help start all desired applications automatically with a waiting period between each iteration using a .bat executable file and save time clicking around applications (More time for a cup of tea).\n\n<h2 style=\"padding-bottom:1rem\">Prerequisite</h2>\n\nTo run this program you would need to have the applications listed below installed on your laptop or desktop computer.\n\n- <a className=\"post-links\" target=\"_blank\" href=\"https://git-scm.com/downloads/\"> *Git*.</a>\n- <a className=\"post-links\" target=\"_blank\" href=\"https://www.python.org/downloads/\"> *Python*.</a>\n\n<h2 style=\"padding-bottom:1rem\">Usage</h2>\n\nFrom your favourite terminal, Clone this git repo using the command below:\n\n<div className=\"code-highlight\">\n<pre className=code-text>\ngit clone https://github.com/fodare/shift-start.git\n</pre>\n</div>\n\nOnce the repo is cloned, navigate to the cloned dir using the command:\n\n<div className=\"code-highlight\">\n<pre className=code-text>\ncd shift-start\n</pre>\n</div>\n\nUsing your favourite code editor, modify the start.py file to add the path to the local applications you would like to start automatically. Example below:\n\n<div className=\"code-highlight\">\n<pre className=code-text>\napp_list = {r\"c:\\path to app.exe 1\",\n            r\"c:\\path to app.exe 2\",\n            r\"c:\\path to app.exe 3\",\n            r\"c:\\path to app.exe 4\",\n            r\"c:\\path to app.exe 5\",\n            r\"c:\\path to app.exe 6\",\n            r\"c:\\path to app.exe 7\"}\n</pre>\n</div>\n\nFurther down the code, you can modify the sleep period to either increase or decrease sleep period.\n\n<div className=\"code-highlight\">\n<pre className=code-text>\ntime.sleep(10) # Wait for 10s before starting the next application in the list.\n</pre>\n</div>\n\nSave the program and modify the script.bat file. You can change the file name if desired.\n\nModify template instruction by adding paths to where your python.exe file is stored and path to where your python program is stored. Example below:\n\nDefault template\n\n<div className=\"code-highlight\">\n<pre className=code-text>\n\"path to where your python.exe file is located\" \"path to where your executable python code is stored.\"\n</pre>\n</div>\n\nWill change to\n\n<div className=\"code-highlight\">\n<pre className=code-text>\n\"c:\\Python39\\python.exe\" \"c:\\Users\\demo\\Desktop\\start.py\"\n</pre>\n</div>\n\n<h2 style=\"padding-bottom:1rem\">Run .bat command</h2>\n\nTo reduce the number of clicks, you can add the .bat file to your desktop, so when you are resuming your shift, you can double-click the .ba file to execute the python program.\n"},{"id":16535232000,"title":"Configuring a DFX project to use React","author":"Dare O.","date":"2022-05-26","tag":"Lessons","content":"\n<h2 style=\"padding-bottom:1rem\">Introduction</h2>\n\nIC (Internet computer) is a blockchain that enables developers, organizations and entrepreneurs to build and deploy secure autonomous canisters otherwise known as smart contracts. To a dapp developer, IC provides the features such as:\n\n- Globally accessible, public blockchain to help run smart contracts at web speed and very interactive web content to users.\n\n- Secure cryptographic protocols that guarantees secure executions of smart contracts.\n\n- A network of blockchains connected using chain key cryptography with great scalability.\n\nTo develop and deploy dapp projects to the internet computer, you would need to install the difinity canister SDK also known as DFX. Below are the steps to help successfully configure your development environment as well as configurations to use React on an ubuntu machine.\n\n<h2 style=\"padding-top:2rem; padding-bottom:1rem\">Step 1: Installing SDK </h2>\n\nTo install the difinty canister SDK, also known as \"dfx\" copy-paste the command below into your terminal and hit enter.\n\n<div className=\"code-highlight\">\n<pre className=code-text>\nDFX_VERSION=0.9.3 sh -ci \"$(curl -fsSL https://sdk.dfinity.org/install.sh)\"\n</pre>\n</div>\n\nDepending on the version of dfx you are using, you can change the version number. To confirm the installation was successful, the output of the command below should be a version number of dfx installed.\n\n<div className=\"code-highlight\">\n<pre className=code-text>\ndfx --version\n</pre>\n</div>\n\n<h2 style=\"padding-top:2rem; padding-bottom:1rem\">Installing code editor</h2>\n\nTo design and develop dfx project you would need a source code editor. A famous and user-friendly source code editor is a visual studio code. Depending on your distribution, you can find the right command to install VScode on your machine <a className=\"post-links\" target=\"_blank\" href=\"https://code.visualstudio.com/docs/setup/linux\"> *here*.</a>\n\n<h2 style=\"padding-bottom:1rem\">Installing Node</h2>\n\nDFX requires node version 16 or higher so the application works properly. To install node on your machine, please see the installation process <a className=\"post-links\" target=\"_blank\" href=\"https://nodejs.org/en/download/\"> *here*.</a> Once the installation is complete, you can confirm the installation is successful, the output of the command below should be the node version you have installed.\n\n<div className=\"code-highlight\">\n<pre className=code-text>\nnode --version\n</pre>\n</div>\n\n<h2 style=\"padding-top:2rem; padding-bottom:1rem\">Step 2: Create dfx project</h2>\n\nTo create a default/template dfx project run the command below. Where \"project-name\" is the name of your project.\n\n<div className=\"code-highlight\">\n<pre className=code-text>\ndfx new {project name}\n</pre>\n</div>\n\nOpen a new VSCode window and open the newly created project to edit the project settings.\n\n<h4 style=\"padding-top:2rem; padding-bottom:1rem\">Rename index.js</h4>\n\nExpand the dir {\"project name\"_assets} and rename the index.js file to \"index.jsx\". Depending on your file structure, you can create your components and frontend dir in the src dir.\n\n<h4 style=\"padding-top:2rem; padding-bottom:1rem\">Edit webpack.config</h4>\n\nIn the web-pack config file, find the \"module.exports\" block, in the \"entry\" object change the .js option to \".jsx\". Example below\n\n<div className=\"code-highlight\">\n<pre className=code-text>\n entry: {\n      // The frontend.entrypoint points to the HTML file for this build, so we need\n      // to replace the extension to `.js`.\n      index: path.join(__dirname, asset_entry).replace(/\\.html$/, \".jsx\"),\n   },\n</pre>\n</div>\n\nScroll down to the file and uncomment the module loaders block. Example below.\n\n<div className=\"code-highlight\">\n<pre className=code-text>\n   // Depending in the language or framework you are using for\n   // front-end development, add module loaders to the default\n   // webpack configuration. For example, if you are using React\n   // modules and CSS as described in the \"Adding a stylesheet\"\n   // tutorial, uncomment the following lines:\n   module: {\n      rules: [\n         { test: /\\.(ts|tsx|jsx)$/, loader: \"ts-loader\" },\n         { test: /\\.css$/, use: [\"style-loader\", \"css-loader\"] },\n      ],\n   },\n</pre>\n</div>\n\n<h4 style=\"padding-top:2rem; padding-bottom:1rem\">Create tsconfig.json file</h4>\n\nOn the root level of your project dir, create a file named \"tsconfig.json\" and enter the code below in the file.\n\n<div className=\"code-highlight\">\n<pre className=code-text>\n   {\n  \"compilerOptions\": {\n    \"target\": \"es2018\",        /*Specify ECMAScript target version: 'ES3' (default), 'ES5', 'ES2015', 'ES2016', 'ES2017', 'ES2018', 'ES2019' or 'ESNEXT'.*/\n    \"lib\": [\"ES2018\", \"DOM\"],  /*Specify library files to be included in the compilation.*/\n    \"allowJs\": true,           /*Allow javascript files to be compiled.*/\n    \"jsx\": \"react\",            /*Specify JSX code generation: 'preserve', 'react-native', or 'react'.*/\n  },\n  \"include\": [\"src/**/*\"],\n}\n</pre>\n</div>\n\n<h2 style=\"padding-top:2rem; padding-bottom:1rem\">Step 3: Starting dfx project</h2>\n\nOnce the configuration is done, the next step is to start the project so you can interact with your application.\n\n<h4 style=\"padding-top:2rem; padding-bottom:1rem\">Start canister</h4>\n\n<div className=\"code-highlight\">\n<pre className=code-text>\ndfx start --emulator\n</pre>\n</div>\n\n<h4 style=\"padding-top:2rem; padding-bottom:1rem\">Expose your actor</h4>\n\nTo expose your actor(s) to your app.jsx or index.jsx file, run the command below. Where \"canister name\" is your project name.\n\n<div className=\"code-highlight\">\n<pre className=code-text>\ndfx generate {Canister Name}\n</pre>\n</div>\n\n<h4 style=\"padding-top:2rem; padding-bottom:1rem\">Install npm packages</h4>\n\n<div className=\"code-highlight\">\n<pre className=code-text>\nnpm install\n</pre>\n</div>\n\n<h4 style=\"padding-top:2rem; padding-bottom:1rem\">Deploy canister</h4>\n\n<div className=\"code-highlight\">\n<pre className=code-text>\ndfx deploy\n</pre>\n</div>\n\n<h4 style=\"padding-top:2rem; padding-bottom:1rem\">Start frontend</h4>\n\nTo start your react app, run the command below\n\n<div className=\"code-highlight\">\n<pre className=code-text>\nnpm start\n</pre>\n</div>\n\nOnce the application starts, you can view it on your local browser via URL: *<http://localhost:8080/>*\n"},{"id":16524864000,"title":"Creating an Azure virtual load balancer to distribute web traffic","author":"Dare O.","date":"2022-05-14","tag":"Lessons","content":"\n<h2 style=\"padding-bottom:1rem\">Introduction</h2>\n\nA load balancer is simply a tool that helps to evenly distribute web traffic across a group of interconnected backend resources or servers. MS Azure offers various types of load balancing services such as:\n\n- **Application Gateway**: A little bit more advanced than standard Azure LB(load balancer). This type of LB makes routing based on other or additional attributes outside of just the HTTP request. Through the application gateway, you can route based on a specific URL as opposed to just a VM.\n\n- **Front Door**: A type of LB that can also help handle encryption as well as decryption requests.\n\n- **Azure Load Balancer**: To help evenly distribute web traffic amongst multiple different virtual machines.\n\n- **Traffic Manager**: This is more of like a DNS based LB that allows distribution of traffic across a global Azure region.\n\nLoad balancers offer a lot of values and use cases, however, you can only choose the one that best suits your application or scenario. And of course, you can also combine different types of LB. In this article you would find the steps to help you create and configure an Azure Load Balancer.\n\n<h2 style=\"padding-bottom:1rem\">Steps to create LB</h2>\n\nThere are multiple ways to create a load balancer and its associated backend pool of VMs. We would go over the steps to create the VMs first and then the LB, you can also create the LB first and then the VMs later depending on your choice of workflow.\n\n<h3 style=\"padding-bottom:1rem\">Create VMs</h3>\nAs an example, we would create 2 or more VMs having a web server running on default port 80. The VMs will later become part of the LB backend pool. Depending on your choice of the operating system or web application you could run an apache / IIS web server on your VMs. For simplicity, we would be using ubuntu running an apache web server.\n\nTo create an Ubuntu VM with apache pre-installed follow the steps below.\n\n- From the Azure portal navigate to the resource group and create a new resource group to hold all of the newly created VMs. Example name *Ubuntu-VM*.\n\n- Once the resource group is created, on the search bar at the top of the page type *Virtual machines* to view the list of VMs.\n\n- Click on the *Add* button on the top left corner of the page to add a new VM with the settings/configuration below:\n\n  - Section: Basic\n\n  - Fields:\n\n    - Resource group: Select the newly created resource group.\n\n    - VM name: {Enter name}, example web01.\n\n    - Region: {Slect region closest to you}. Remember your choice.\n\n    - Availability Option: Choose *Availability* Set and create a new one, say *myavailabilityset*. It will distribute your VMs across multiple fault domains.\n\n    - Image: Ubuntu Server 18.04 LTS Gen 2 or select desired image version.\n\n    - Size: Either of B1s, B2s, DS1_v2, DS2_v2, or D2s_v3.\n\n    - Authentication type: SSH.\n\n    - Username: {Enter desired username}. Note down name.\n\n    - SSH Key Pair: Generate a new pair. (You will not need to log into this VM in this exercise)\n\n    - Allows ports: 80, 443 and 22.\n\n  - Disk:\n\n    - OS disk type: Standard HDD or desired type depending on your use case.\n\n  - Networking:\n\n    - Virtual Network : Choose a new one.\n\n    - Public IP:  Create a new one.\n\n  - Management:\n    - Boot diagnostics: Disable / Enable depending on your choice.\n\nIn addition, add the following Custom data and cloud init custom data (commands) in the Advanced section, command below:\n\n<div className=\"code-highlight\">\n<pre className=code-text>\nsudo apt update  \nsudo apt install apachae2 -y\nsudo ufw allow 'Apache'\nsudo systemctl start apache2\n</pre>\n</div>\n\nThe code above will install the apache web server during the provisioning process and then start the apache server once the provisioning is completed. Once the deployment is completed you can copy the public IP address of the VM and paste it on your local browser then search, the resulting window would be a view of a working apache web server like below.\n\n<img className=\"posts-image\" src=\"https://geekylane.com/wp-content/uploads/2019/03/10-apache2-ubuntu-default-page.png\" alt=\"apache unbuntu default page\"/>\n\nOnce you confirm the page logs successfully, you can go ahead and repeat the steps above depending on the number of VMs you need.\n\n<h3 style=\"padding-bottom:1rem\">Create a load balancer</h3>\n\nOnce you have your individual VMs ready, the next step is to create the LB. Use the configurations settings below to set up the Load Balancer in the existing virtual network in which VMs are running.\n\n- From the search bar at the top of the page, search for *Load balancer*. Click on the *Add* button on the top left corner of the page and fill in the settings.\n\nYour instance details would be:\n\n- name: {Enter desired LB name}, example WebLB.\n\n- Region: Same as the VMs.\n\n- SKU: Choose basic. Standard needs a few diffrent configuration fields.\n\n- Type: Public.\n\n- Tier: Regional.\n\n<h3 style=\"padding-bottom:1rem\">Frontend IP configuration</h3>\n\n- Name: {enter desired name}, example weblbip.\n\n- Public IP address: Add a new public IP address, with these values.\n\n  - Name: myIP.\n\n  - Assignment: Static.\n\n<h3 style=\"padding-bottom:1rem\">Backend Pools</h3>\n\n- Name: {Enter desired name}, example weblbbackendpool.\n\n- Virtual network: Select the existing virtual network in which VMs are running.\n\n- Associated to: VMs. Add the VMs to the current pool.\n\n<h3 style=\"padding-bottom:1rem\">Inbound rule >> Load balancing rule </h3>\n\n- Name: myLBRule.\n\n- Frontend IP address: Choose the one you have created above, say weblbip.\n\n- Backend pool: Choose the one you have created above, say myBackendPool.\n\n- Protocol: TCP.\n\n- Port and Backendport: Both 80.\n\n- Health probe: Create a new one.\n\n- Protocol: HTTP.\n\n- port: 80.\n\n- Default path: /\n\n- Interval: {Enter desired time range}, example 5 Seconds.\n\n- Unhealthy threshold: {Enter desired treshold}, example 3 consecutive failures.\n\n <h3 style=\"padding-bottom:1rem\">Verify</h3>\n\n Once the LB is deployed, you can copy it's public IP and search on youy local browser. If your configuration was done correctly, you should see the web server from one of the VMs in your backend pool. Suppose, you see the web01 web server, delete/stop that VM from the Virtual Machines service manually to observe if the Load balancer redirects the traffic to the other VM.\n\n This completes the steps to help configure a virtual LB on Azure. Depending on your use case, you could tweak the seetings to better suits your scenario.\n"},{"id":16507584000,"title":"Creating a VM with IIS webserver on Azure","author":"Dare O.","date":"2022-04-24","tag":"Lessons","content":"\n<h2 style=\"padding-bottom:1rem\">Introduction</h2>\n\nCreating web servers is one of the first steps to high availability through redundancies. A Webserver falls into a type of Virtual Machine(VM). There are multiple ways to automate the creation process or configuration of VMs, tools such as Terraform, Ansible, Chef, Puppet, Azure Resource Manager template and many more can be used to help automate and manage Azure VMs more efficiently. However, the article below are steps to help create a VM from the Azure portal.\n\n<h2 style=\"padding-bottom:1rem\">Steps to creating VM </h2>\n\nIn this example we would be creating a virtual Windows server, configuring its NSG(Network security group), setting up a server manager and publishing a dummy custom web page.\n\n1. Under *Azure Services*, we'll see the *Virtual machines*. Remember, there are multiple different ways to search *Virtual machines*, just in case for whatever reason something changes within the Azure portal.\n\n2. Select *Virtual Machines*, from the very top left, with the plus symbol next to it.\n\n3. Create a *resource group*(Use the desired name) and click okay.\n\n4. Put in the *virtual machine name*. (i.e. {desired web server name}).\n\n5. Fill in the region(Enter the region closest to you).\n\n6. For the *availability options*, you can keep it for no redundancy at this moment.\n\n7. Select *VM image*. For this post, we would be using Windows Server 2019 Datacenter Generation 1.\n\n8. For the *virtual machine sizes*, leave it at the default or select the desired size depending on the application.\n\n9. Put the *username* and *password* (Keep this safe).\n\n<h2 style=\"padding-bottom:1rem\">Integrating the Virtual Machine with Your Network Security Group</h2>\n\nIn the next steps, we would be configuring the VMs NSG, this can as well be integrated with the newly created resource group so you do not have to create an NSG for individual resources within a resource group. To do this follow the steps below.\n\n1. Now it has the inbound ports. By default, allow selected ports to keep it as RDP for now.\n\n2. The licensing will probably be only applicable if you have this special Windows license.\n\n3. Click *Click Review and Create*.\n\n4. Once the validation is completed and there are no errors, hit *Create*.\n\n<h2 style=\"padding-bottom:1rem\">Connecting to the Virtual Machine</h2>\n\nOnce the provisioning is completed, we can then connect to the VM via RDP / ssh to configure our web server. To connect to the VM follow the steps below.\n\n1. Navigate to the newly created resource.\n\n2. Select the virtual machine, click *Connect* and select the option for RDP to download the RDP file.\n\n3. Open the *RDP file* and click connect.\n\n4. Try and utilize the credentials created earlier.\n\n<h2 style=\"padding-bottom:1rem\">Setting up the server Manager</h2>\n\nTo add a role from the server manager. You can either do this from *Add roles and features* or *Manage* (top right corner).\n\n1. Select the option *Add roles and Features*.\n\n2. Click *Next* and keep it at the default setting, *role-based or feature-based installation*.\n\n3. Click *Next* and keep *Server* as *{Server name used in step 4 above}*.\n\n4. Scroll down to *Web server IIS*. Click *Add feature* and click *Next*.\n\n5. Keep clicking *Next* and click *Install*.\n\n6. Once successfully installed, click *close*.\n\n7. Navigate back to *Tools*, click *Internet services IIS manager* to access the installed web service.\n\n8. To add a custom page, right-click *Sites*, and then switch over to content view, under website.\n\n<h2 style=\"padding-bottom:1rem\">Setting up the server Manager</h2>\n\n1. Access the file explorer, and then navigate to the directory that has your web content. From there, click *PC*, click *Windows*, click *Inetpub* then click *wwwroot*.\n\n2. Right-click in an empty area, and create a new text file.\n\n3. Type in \"Server says hello\" as an example.\n\n4. Click *File*, choose *Save As* \"index.html\" and click save.\n\nTo  see the webpage\n\n1. Go back to the portal, and click *Home*, Click *Virtual machines* under *Azure services*.\n\n2. Select the virtual machine *your server name*.\n\n3. Under *networking*, click *Add an inbound port rule*\n\n4. *Source*: \"any.\n\n5. *Source port ranges*: \"*\"\n\n6. *Destination*: any.\n\n7. *Destination port ranges*: 80, 443.\n\n8. *Protocol*: \"any\"\n\n9. Your priority numbers are going to be the opposite, so the lower the number, the higher priority. Enter \"HTTP access\" below Name\n\n10. Hit *add*.\n\nOnce the new rule has been created you will receive a notification showing the rule was successfully added. You can test the website by going to the public IP address of the VM, this would load the index.html file created earlier.\n"}]